### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [1]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [1]:
import pandas

In [2]:
import pandas as pd

# Your updated data with GPA
data = {
    'Name': ["Muhammad Ismaeel jan", "Mujtaba Zahoor", "Muhammad Abid", "Shumail Khan", "Qasim Ali"],
    'Marks': [80, 72, 77, 65, 15],
    'Class': ["4st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"],
    'GPA': [3.4, 3.5, 3.5, 2.6, 1.0]
}

# Create and save dataset.csv
df = pd.DataFrame(data)
df.to_csv('dataset.csv', index=False)

# Read the dataset
classData = pd.read_csv('dataset.csv')
print(classData)

                   Name  Marks     Class  GPA
0  Muhammad Ismaeel jan     80  4st Year  3.4
1        Mujtaba Zahoor     72  2nd Year  3.5
2         Muhammad Abid     77  1st Year  3.5
3          Shumail Khan     65  3rd Year  2.6
4             Qasim Ali     15  2nd Year  1.0

In [34]:
dict1 = {
    'Name': ["Muhammad Ayub", "Ibraheem khan", "Muhammad Abid", "Shumail Khan","Qasim Ali"],
    'Marks': [80, 72, 77, 65, 15],
    'Class':["1st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"],
    'GPA': [3.4, 3.5, 3.5, 2.6, 1.0]
}

In [35]:
df = pandas.DataFrame(dict1)

In [36]:
df = pandas.DataFrame(dict1)

In [37]:
df

            Name  Marks     Class  GPA
0  Muhammad Ayub     80  1st Year  3.4
1  Ibraheem khan     72  2nd Year  3.5
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [38]:
import pandas as pd

In [39]:
df = pd.DataFrame(dict1)

In [40]:
df

            Name  Marks     Class  GPA
0  Muhammad Ayub     80  1st Year  3.4
1  Ibraheem khan     72  2nd Year  3.5
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [41]:
pd.__version__

'1.3.5'

## Import to CSV

In [42]:
df.to_csv('pythonMonday.csv')

## Remove Index

In [43]:
df.to_csv('pythonMondayRemoveIndex.csv', index=False)

## Show some rows from the Start

In [44]:
df.head()

            Name  Marks     Class  GPA
0  Muhammad Ayub     80  1st Year  3.4
1  Ibraheem khan     72  2nd Year  3.5
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

In [45]:
df.head()

            Name  Marks     Class  GPA
0  Muhammad Ayub     80  1st Year  3.4
1  Ibraheem khan     72  2nd Year  3.5
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

In [46]:
df.tail(3)

            Name  Marks     Class  GPA
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

In [47]:
df.tail()

            Name  Marks     Class  GPA
0  Muhammad Ayub     80  1st Year  3.4
1  Ibraheem khan     72  2nd Year  3.5
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

In [48]:
df.describe()

           Marks       GPA
count   5.000000  5.000000
mean   61.800000  2.800000
std    26.771253  1.074709
min    15.000000  1.000000
25%    65.000000  2.600000
50%    72.000000  3.400000
75%    77.000000  3.500000
max    80.000000  3.500000

In [176]:
classData= pd.read_csv(r'C:\Users\syedm\Desktop\Electrical (Communication)\8TH SEMESTER 2025\INTRODUCTION TO MACHINE LEARNING LAB\MACHINE LAB WORKS\LAB 3\pythonMonday.csv')

In [177]:
classData

   Unnamed: 0           Name  Marks     Class  GPA
0           0  Muhammad Ayub     80  1st Year  3.4
1           1  Ibraheem khan     72  2nd Year  3.5
2           2  Muhammad Abid     77  1st Year  3.5
3           3   Shumail Khan     65  3rd Year  2.6
4           4      Qasim Ali     15  2nd Year  1.0

In [178]:
classData.drop(0, axis=0)

   Unnamed: 0           Name  Marks     Class  GPA
1           1  Ibraheem khan     72  2nd Year  3.5
2           2  Muhammad Abid     77  1st Year  3.5
3           3   Shumail Khan     65  3rd Year  2.6
4           4      Qasim Ali     15  2nd Year  1.0

In [179]:
classData

   Unnamed: 0           Name  Marks     Class  GPA
0           0  Muhammad Ayub     80  1st Year  3.4
1           1  Ibraheem khan     72  2nd Year  3.5
2           2  Muhammad Abid     77  1st Year  3.5
3           3   Shumail Khan     65  3rd Year  2.6
4           4      Qasim Ali     15  2nd Year  1.0

In [180]:
classData['Marks']

0    80
1    72
2    77
3    65
4    15
Name: Marks, dtype: int64

In [181]:
classData['Class']

0    1st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [182]:
classData['Class']

0    1st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [183]:
classData['Name']

0    Muhammad Ayub
1    Ibraheem khan
2    Muhammad Abid
3     Shumail Khan
4        Qasim Ali
Name: Name, dtype: object

In [184]:
classData['Name']

0    Muhammad Ayub
1    Ibraheem khan
2    Muhammad Abid
3     Shumail Khan
4        Qasim Ali
Name: Name, dtype: object

In [185]:
type(classData['Name'])

pandas.core.series.Series

In [187]:
classData['GPA']

0    3.4
1    3.5
2    3.5
3    2.6
4    1.0
Name: GPA, dtype: float64

In [188]:
classData['GPA'][0]

3.4

In [189]:
classData['GPA'][0]=90

C:\Users\musta\anaconda3\envs\myenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [63]:
classData

   Unnamed: 0           Name  Marks        Class
0           0  Muhammad Ayub     80     1st Year
1           1  Ibraheem khan     72     2nd Year
2           2  Muhammad Abid     77     1st Year
3           3   Shumail Khan     65     3rd Year
4           4      Qasim Ali     15  Second Year

In [190]:
classData['GPA'][4]

1.0

In [191]:
classData['GPA'][4]=5

C:\Users\musta\anaconda3\envs\myenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [62]:
classData["Class"][4]="Second Year"

C:\Users\musta\anaconda3\envs\myenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [64]:
classData

   Unnamed: 0           Name  Marks        Class
0           0  Muhammad Ayub     80     1st Year
1           1  Ibraheem khan     72     2nd Year
2           2  Muhammad Abid     77     1st Year
3           3   Shumail Khan     65     3rd Year
4           4      Qasim Ali     15  Second Year

In [66]:
classData["Name"][4]

'Qasim Ali'

In [67]:
classData

   Unnamed: 0           Name  Marks        Class
0           0  Muhammad Ayub     80     1st Year
1           1  Ibraheem khan     72     2nd Year
2           2  Muhammad Abid     77     1st Year
3           3   Shumail Khan     65     3rd Year
4           4      Qasim Ali     15  Second Year

In [4]:
classData.to_csv('pythonMondayNew.csv')

NameError: name 'classData' is not defined

In [69]:
classData.to_csv('pythonMondayNewRemoveIndex.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [70]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [71]:
classData

        Unnamed: 0           Name  Marks        Class
First            0  Muhammad Ayub     80     1st Year
Second           1  Ibraheem khan     72     2nd Year
Third            2  Muhammad Abid     77     1st Year
Fourth           3   Shumail Khan     65     3rd Year
Fifth            4      Qasim Ali     15  Second Year

In [72]:
classData["Name"]["Fifth"]

'Qasim Ali'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [1]:
classData['GPA']

NameError: name 'classData' is not defined

In [84]:
 type(classData['gpa'])

pandas.core.series.Series

In [85]:
classData

                 name     gpa class
First   ibraheem khan   90.00    3rd
Second     tayyab khan   3.45    4th
Third       abbas khan   2.90    5th
Fourth      ayub khan    3.84    6th
Fifth     mobeen khan    5.00    7th

In [74]:
type(classData)

pandas.core.frame.DataFrame

In [75]:
import numpy as np

In [76]:
series1= pd.Series(np.random.rand())

In [77]:
series1

0    0.473624
dtype: float64

In [78]:
series1= pd.Series(np.random.rand(30))

In [79]:
series1

0     0.269831
1     0.753303
2     0.768341
3     0.971131
4     0.947583
5     0.235908
6     0.563422
7     0.752262
8     0.983658
9     0.210488
10    0.158655
11    0.997442
12    0.993786
13    0.983915
14    0.335975
15    0.195662
16    0.835551
17    0.325466
18    0.470824
19    0.398143
20    0.084307
21    0.391305
22    0.693388
23    0.966866
24    0.046515
25    0.879099
26    0.806707
27    0.565309
28    0.138876
29    0.780724
dtype: float64

In [80]:
type(series1)

pandas.core.series.Series

In [81]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [82]:
type(newDf)

pandas.core.frame.DataFrame

In [83]:
newDf

            0         1         2         3         4
0    0.325805  0.482299  0.836373  0.776291  0.203318
1    0.225439  0.201162  0.418488  0.016248  0.988362
2    0.740812  0.030774  0.458003  0.333377  0.420288
3    0.404031  0.418655  0.631875  0.966758  0.659665
4    0.578145  0.801905  0.590266  0.573635  0.871967
..        ...       ...       ...       ...       ...
325  0.188387  0.012860  0.409965  0.518303  0.664129
326  0.565824  0.918626  0.461514  0.551333  0.850603
327  0.657128  0.649857  0.808362  0.540821  0.801601
328  0.265060  0.790084  0.964930  0.930247  0.324783
329  0.261255  0.665670  0.312482  0.690491  0.942831

[330 rows x 5 columns]

In [84]:
newDf.head(2)

          0         1         2         3         4
0  0.325805  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362

In [85]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [86]:
newDf.tail(2)

            0         1         2         3         4
328  0.265060  0.790084  0.964930  0.930247  0.324783
329  0.261255  0.665670  0.312482  0.690491  0.942831

In [87]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [88]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.510648    0.508864    0.522949    0.507679    0.507814
std      0.302716    0.286525    0.284004    0.289988    0.292978
min      0.000232    0.005802    0.000158    0.002463    0.003711
25%      0.232953    0.275830    0.280005    0.274247    0.272000
50%      0.515596    0.500820    0.538041    0.492354    0.492876
75%      0.780781    0.755718    0.763348    0.781237    0.746286
max      0.997796    0.997713    0.996767    0.995490    0.996096

In [89]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [90]:
newDf[0][0]= "Maaz Khan"

In [91]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [92]:
newDf

             0         1         2         3         4
0    Maaz Khan  0.482299  0.836373  0.776291  0.203318
1     0.225439  0.201162  0.418488  0.016248  0.988362
2     0.740812  0.030774  0.458003  0.333377  0.420288
3     0.404031  0.418655  0.631875  0.966758  0.659665
4     0.578145  0.801905  0.590266  0.573635  0.871967
..         ...       ...       ...       ...       ...
325   0.188387  0.012860  0.409965  0.518303  0.664129
326   0.565824  0.918626  0.461514  0.551333  0.850603
327   0.657128  0.649857  0.808362  0.540821  0.801601
328    0.26506  0.790084  0.964930  0.930247  0.324783
329   0.261255  0.665670  0.312482  0.690491  0.942831

[330 rows x 5 columns]

In [93]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [94]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [95]:
newDf.to_numpy()

array([['Maaz Khan', 0.4822990508636614, 0.8363730820120484,
        0.7762910586820098, 0.2033176437424743],
       [0.22543948811042425, 0.20116150840533586, 0.41848762786659477,
        0.01624816982138566, 0.9883617960273158],
       [0.74081232116499, 0.03077378182904067, 0.4580026201207519,
        0.3333774690400656, 0.4202881486143204],
       ...,
       [0.6571283661581864, 0.6498570131424033, 0.808362479314796,
        0.540820846399879, 0.8016005219061507],
       [0.26505982850016907, 0.7900842866005595, 0.9649302617897377,
        0.9302468386168853, 0.3247826164440555],
       [0.26125534497708414, 0.6656695368442971, 0.31248192333059777,
        0.6904908341966716, 0.9428313376841609]], dtype=object)

In [96]:
newDf[0][0]=0.30

In [97]:
newDf.head()

          0         1         2         3         4
0       0.3  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665
4  0.578145  0.801905  0.590266  0.573635  0.871967

In [98]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.225439,0.740812,0.404031,0.578145,0.968439,0.575848,0.665258,0.997796,0.950289,...,0.832728,0.082111,0.87451,0.955054,0.01727,0.188387,0.565824,0.657128,0.26506,0.261255
1,0.482299,0.201162,0.030774,0.418655,0.801905,0.140627,0.682413,0.175649,0.452995,0.387497,...,0.990168,0.453895,0.750673,0.24293,0.525904,0.01286,0.918626,0.649857,0.790084,0.66567
2,0.836373,0.418488,0.458003,0.631875,0.590266,0.423572,0.98529,0.649314,0.257786,0.60645,...,0.96998,0.036914,0.568572,0.616618,0.756368,0.409965,0.461514,0.808362,0.96493,0.312482
3,0.776291,0.016248,0.333377,0.966758,0.573635,0.165695,0.981175,0.375792,0.39129,0.136105,...,0.102298,0.148285,0.852195,0.93146,0.378724,0.518303,0.551333,0.540821,0.930247,0.690491
4,0.203318,0.988362,0.420288,0.659665,0.871967,0.09514,0.435884,0.575691,0.83105,0.81027,...,0.221063,0.641191,0.103882,0.271923,0.088938,0.664129,0.850603,0.801601,0.324783,0.942831

In [99]:
newDf.sort_index(axis=0)

            0         1         2         3         4
0         0.3  0.482299  0.836373  0.776291  0.203318
1    0.225439  0.201162  0.418488  0.016248  0.988362
2    0.740812  0.030774  0.458003  0.333377  0.420288
3    0.404031  0.418655  0.631875  0.966758  0.659665
4    0.578145  0.801905  0.590266  0.573635  0.871967
..        ...       ...       ...       ...       ...
325  0.188387  0.012860  0.409965  0.518303  0.664129
326  0.565824  0.918626  0.461514  0.551333  0.850603
327  0.657128  0.649857  0.808362  0.540821  0.801601
328   0.26506  0.790084  0.964930  0.930247  0.324783
329  0.261255  0.665670  0.312482  0.690491  0.942831

[330 rows x 5 columns]

In [100]:
newDf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
329  0.261255  0.665670  0.312482  0.690491  0.942831
328   0.26506  0.790084  0.964930  0.930247  0.324783
327  0.657128  0.649857  0.808362  0.540821  0.801601
326  0.565824  0.918626  0.461514  0.551333  0.850603
325  0.188387  0.012860  0.409965  0.518303  0.664129
..        ...       ...       ...       ...       ...
4    0.578145  0.801905  0.590266  0.573635  0.871967
3    0.404031  0.418655  0.631875  0.966758  0.659665
2    0.740812  0.030774  0.458003  0.333377  0.420288
1    0.225439  0.201162  0.418488  0.016248  0.988362
0         0.3  0.482299  0.836373  0.776291  0.203318

[330 rows x 5 columns]

In [101]:
newDf.sort_index(axis=1)

            0         1         2         3         4
0         0.3  0.482299  0.836373  0.776291  0.203318
1    0.225439  0.201162  0.418488  0.016248  0.988362
2    0.740812  0.030774  0.458003  0.333377  0.420288
3    0.404031  0.418655  0.631875  0.966758  0.659665
4    0.578145  0.801905  0.590266  0.573635  0.871967
..        ...       ...       ...       ...       ...
325  0.188387  0.012860  0.409965  0.518303  0.664129
326  0.565824  0.918626  0.461514  0.551333  0.850603
327  0.657128  0.649857  0.808362  0.540821  0.801601
328   0.26506  0.790084  0.964930  0.930247  0.324783
329  0.261255  0.665670  0.312482  0.690491  0.942831

[330 rows x 5 columns]

In [102]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.203318  0.776291  0.836373  0.482299       0.3
1    0.988362  0.016248  0.418488  0.201162  0.225439
2    0.420288  0.333377  0.458003  0.030774  0.740812
3    0.659665  0.966758  0.631875  0.418655  0.404031
4    0.871967  0.573635  0.590266  0.801905  0.578145
..        ...       ...       ...       ...       ...
325  0.664129  0.518303  0.409965  0.012860  0.188387
326  0.850603  0.551333  0.461514  0.918626  0.565824
327  0.801601  0.540821  0.808362  0.649857  0.657128
328  0.324783  0.930247  0.964930  0.790084   0.26506
329  0.942831  0.690491  0.312482  0.665670  0.261255

[330 rows x 5 columns]

In [103]:
newDf.head()

          0         1         2         3         4
0       0.3  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665
4  0.578145  0.801905  0.590266  0.573635  0.871967

In [104]:
newDf[0][1]

0.22543948811042425

In [105]:
type(newDf[0])

pandas.core.series.Series

In [106]:
newDf

            0         1         2         3         4
0         0.3  0.482299  0.836373  0.776291  0.203318
1    0.225439  0.201162  0.418488  0.016248  0.988362
2    0.740812  0.030774  0.458003  0.333377  0.420288
3    0.404031  0.418655  0.631875  0.966758  0.659665
4    0.578145  0.801905  0.590266  0.573635  0.871967
..        ...       ...       ...       ...       ...
325  0.188387  0.012860  0.409965  0.518303  0.664129
326  0.565824  0.918626  0.461514  0.551333  0.850603
327  0.657128  0.649857  0.808362  0.540821  0.801601
328   0.26506  0.790084  0.964930  0.930247  0.324783
329  0.261255  0.665670  0.312482  0.690491  0.942831

[330 rows x 5 columns]

## view

In [107]:
newDfView=newDf

In [108]:
newDfView

            0         1         2         3         4
0         0.3  0.482299  0.836373  0.776291  0.203318
1    0.225439  0.201162  0.418488  0.016248  0.988362
2    0.740812  0.030774  0.458003  0.333377  0.420288
3    0.404031  0.418655  0.631875  0.966758  0.659665
4    0.578145  0.801905  0.590266  0.573635  0.871967
..        ...       ...       ...       ...       ...
325  0.188387  0.012860  0.409965  0.518303  0.664129
326  0.565824  0.918626  0.461514  0.551333  0.850603
327  0.657128  0.649857  0.808362  0.540821  0.801601
328   0.26506  0.790084  0.964930  0.930247  0.324783
329  0.261255  0.665670  0.312482  0.690491  0.942831

[330 rows x 5 columns]

In [109]:
newDfView[0][0]=765

C:\Users\musta\anaconda3\envs\myenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [110]:
newDf.head()

          0         1         2         3         4
0       765  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665
4  0.578145  0.801905  0.590266  0.573635  0.871967

In [111]:
newDfView.head()

          0         1         2         3         4
0       765  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665
4  0.578145  0.801905  0.590266  0.573635  0.871967

In [112]:
newDfCopy=newDf.copy()

In [113]:
newDfCopy[0][0]=656

C:\Users\musta\anaconda3\envs\myenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [114]:
newDf.head()

          0         1         2         3         4
0       765  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665
4  0.578145  0.801905  0.590266  0.573635  0.871967

In [115]:
newDfCopy.head()

          0         1         2         3         4
0       656  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665
4  0.578145  0.801905  0.590266  0.573635  0.871967

## loc

In [116]:
newDf.head(2)

          0         1         2         3         4
0       765  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362

In [117]:
newDf.loc[0,0]

765

In [118]:
newDf.loc[0,0]=5678

In [119]:
newDf.head(2)

          0         1         2         3         4
0      5678  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362

In [120]:
newDf.loc[0,4]

0.2033176437424743

In [121]:
newDf.loc[325,1]

0.012860265713901309

In [122]:
newDf.loc[0,0]=9875

In [123]:
newDf.head(2)

          0         1         2         3         4
0      9875  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362

In [124]:
newDf.columns=list("ABCDE")

In [125]:
newDf.head(3)

          A         B         C         D         E
0      9875  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288

In [126]:
newDf.loc[0, "A"]

9875

In [127]:
newDf.loc[0,"A"]=65

In [128]:
newDf.head(3)

          A         B         C         D         E
0        65  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288

In [129]:
newDf.loc[35,"A"]

0.9634511179301223

In [130]:
newDf.drop(0, axis=0).head(3)

          A         B         C         D         E
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288
3  0.404031  0.418655  0.631875  0.966758  0.659665

In [131]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.482299  0.836373  0.776291  0.203318
1  0.201162  0.418488  0.016248  0.988362
2  0.030774  0.458003  0.333377  0.420288

In [132]:
newDf.head(3)

          A         B         C         D         E
0        65  0.482299  0.836373  0.776291  0.203318
1  0.225439  0.201162  0.418488  0.016248  0.988362
2  0.740812  0.030774  0.458003  0.333377  0.420288

In [133]:
newDf = newDf.drop("A", axis=1)

In [134]:
newDf.head(3)

          B         C         D         E
0  0.482299  0.836373  0.776291  0.203318
1  0.201162  0.418488  0.016248  0.988362
2  0.030774  0.458003  0.333377  0.420288

In [135]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.418488  0.016248
2  0.458003  0.333377

In [136]:
newDf.head(3)

          B         C         D         E
0  0.482299  0.836373  0.776291  0.203318
1  0.201162  0.418488  0.016248  0.988362
2  0.030774  0.458003  0.333377  0.420288

In [137]:
newDf.loc[:,["C","D"]]

            C         D
0    0.836373  0.776291
1    0.418488  0.016248
2    0.458003  0.333377
3    0.631875  0.966758
4    0.590266  0.573635
..        ...       ...
325  0.409965  0.518303
326  0.461514  0.551333
327  0.808362  0.540821
328  0.964930  0.930247
329  0.312482  0.690491

[330 rows x 2 columns]

In [138]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.201162  0.418488  0.016248  0.988362
2  0.030774  0.458003  0.333377  0.420288

In [139]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.836373  0.776291
1  0.418488  0.016248
2  0.458003  0.333377
3  0.631875  0.966758
4  0.590266  0.573635
5  0.423572  0.165695

In [140]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.201162  0.418488  0.016248
2  0.030774  0.458003  0.333377

In [141]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
1    0.201162  0.418488  0.016248  0.988362
2    0.030774  0.458003  0.333377  0.420288
5    0.140627  0.423572  0.165695  0.095140
7    0.175649  0.649314  0.375792  0.575691
10   0.275574  0.051858  0.982347  0.468713
..        ...       ...       ...       ...
309  0.126923  0.673769  0.420490  0.152019
312  0.101180  0.722165  0.235431  0.647880
316  0.191567  0.939014  0.421261  0.715000
323  0.242930  0.616618  0.931460  0.271923
325  0.012860  0.409965  0.518303  0.664129

[93 rows x 4 columns]

In [142]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
2    0.030774  0.458003  0.333377  0.420288
7    0.175649  0.649314  0.375792  0.575691
10   0.275574  0.051858  0.982347  0.468713
12   0.044397  0.537253  0.234681  0.878155
14   0.078867  0.692507  0.871417  0.552193
..        ...       ...       ...       ...
309  0.126923  0.673769  0.420490  0.152019
312  0.101180  0.722165  0.235431  0.647880
316  0.191567  0.939014  0.421261  0.715000
323  0.242930  0.616618  0.931460  0.271923
325  0.012860  0.409965  0.518303  0.664129

[72 rows x 4 columns]

In [143]:
newDf.head(3)

          B         C         D         E
0  0.482299  0.836373  0.776291  0.203318
1  0.201162  0.418488  0.016248  0.988362
2  0.030774  0.458003  0.333377  0.420288

## iloc

In [144]:
newDf.iloc[0,0]

0.4822990508636614

In [145]:
newDf.iloc[0,0]=555

In [146]:
newDf.head()

            B         C         D         E
0  555.000000  0.836373  0.776291  0.203318
1    0.201162  0.418488  0.016248  0.988362
2    0.030774  0.458003  0.333377  0.420288
3    0.418655  0.631875  0.966758  0.659665
4    0.801905  0.590266  0.573635  0.871967

In [147]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.836373  0.203318
4  0.590266  0.871967

In [148]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.836373  0.776291  0.203318
1    0.201162  0.418488  0.016248  0.988362
2    0.030774  0.458003  0.333377  0.420288
3    0.418655  0.631875  0.966758  0.659665

In [149]:
newDf.drop(0).head()

          B         C         D         E
1  0.201162  0.418488  0.016248  0.988362
2  0.030774  0.458003  0.333377  0.420288
3  0.418655  0.631875  0.966758  0.659665
4  0.801905  0.590266  0.573635  0.871967
5  0.140627  0.423572  0.165695  0.095140

In [150]:
# newDf.drop(0, axis=1)

In [151]:
# newDf.drop("B", axis=1).head()

In [152]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.203318
1    0.201162  0.988362
2    0.030774  0.420288
3    0.418655  0.659665
4    0.801905  0.871967

In [153]:
newDf.head()

            B         C         D         E
0  555.000000  0.836373  0.776291  0.203318
1    0.201162  0.418488  0.016248  0.988362
2    0.030774  0.458003  0.333377  0.420288
3    0.418655  0.631875  0.966758  0.659665
4    0.801905  0.590266  0.573635  0.871967

In [154]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [155]:
newDf.head()

          C         E
0  0.836373  0.203318
1  0.418488  0.988362
2  0.458003  0.420288
3  0.631875  0.659665
4  0.590266  0.871967

In [156]:
newDf.reset_index().head()

   index         C         E
0      0  0.836373  0.203318
1      1  0.418488  0.988362
2      2  0.458003  0.420288
3      3  0.631875  0.659665
4      4  0.590266  0.871967

In [157]:
newDf.reset_index(drop=True).head()

          C         E
0  0.836373  0.203318
1  0.418488  0.988362
2  0.458003  0.420288
3  0.631875  0.659665
4  0.590266  0.871967

In [158]:
newDf.head()

          C         E
0  0.836373  0.203318
1  0.418488  0.988362
2  0.458003  0.420288
3  0.631875  0.659665
4  0.590266  0.871967

In [159]:
newDf.reset_index(drop=True, inplace=True)

In [160]:
newDf.head()

          C         E
0  0.836373  0.203318
1  0.418488  0.988362
2  0.458003  0.420288
3  0.631875  0.659665
4  0.590266  0.871967

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [161]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [162]:
df = pd.DataFrame(data)

In [163]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [164]:
df.groupby('Company')

##### You can save this object as a new variable:

In [165]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [166]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [167]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [168]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [169]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [170]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [171]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [172]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0